import  {create}  from 'zustand'; 
//  создание стора
import { generateId } from './helpers';
interface Task { 
    // создание интерфейса задач(описание типов)
    id:string;
    // id самой задачи уникальное
    title:string;
    createdAt:number; 
    // время создания задачи
}
interface ToDoStore {
    tasks: Task[];
    //  массив задач
    createTask:(title:string)=>void;
    //  тип функции ничего не возвращает
    updateTask:(id:string, title:string)=>void;
    removeTask:(id:string)=>void;
}

 export const useToDoStore = create<ToDoStore>((set,get) => ({
    // создание стора-это одно общее место, где программа хранит важные данные.
//     Здесь происходит главное:
// create<ToDoStore> — говорим TypeScript, какой формы будет store
// set — функция для обновления состояния
// get — функция для получения текущего состояния
// 📌 useToDoStore — это React-хук, который ты используешь в компонентах.
    tasks:[
        {
        id:'jijdijic',
        title:'task1',
        createdAt:252626
// //         Это стартовые данные:
// // при первом запуске store уже содержит одну задачу
    },
    {
        id:'sxnjcjk',
        title:'task2',
        createdAt:657478
    },
],
    createTask:(title)=>{
        const{tasks}=get(); 
        // получаем все таски
        const newTask={
            // создание новой задачи
            id:generateId(),
            title,
            createdAt:Date.now(),
        }
        set({
            tasks:[newTask].concat(tasks), 
            // берем новый таск и присоединяем старые
//             старый массив не изменяется
// создаётся новый массив
// новая задача добавляется в начало
        })
    },
    updateTask:(id:string,title:string)=>{
    const {tasks}=get();
set({
    tasks:tasks.map((task)=>({
//         map проходит по всем задачам
// если task.id === id → меняем title
// если нет → оставляем как есть
// ...task — копируем остальные поля
// 📌 Обновляется только одна задача
        ...task,
        title:task.id===id ? title:task.title,
    }))
});
    },
    removeTask:(id:string)=>{
        const {tasks}=get();
set({
    tasks:tasks.filter((task)=>task.id!==id)
//     filter удаляет задачу с нужным id
// возвращает новый массив без неё
});
    },
}));
 